; ModuleID = 'heat.c'
source_filename = "heat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@ny = dso_local global i32 0, align 4, !dbg !0
@nx = dso_local global i32 0, align 4, !dbg !22
@xu = dso_local global double 0.000000e+00, align 8, !dbg !26
@dx = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !38
@yu = dso_local global double 0.000000e+00, align 8, !dbg !30
@dy = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !40
@dtdxsq = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !44
@dtdysq = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !46
@t = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !48
@leafmaxcol = dso_local global i32 0, align 4, !dbg !50
@nt = dso_local global i32 0, align 4, !dbg !24
@tu = dso_local global double 0.000000e+00, align 8, !dbg !34
@dt = dso_local local_unnamed_addr global double 0.000000e+00, align 8, !dbg !42

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.6 (/afs/ece/project/seth_group/ziqiliu/uli-opencilk-project/clang f7f98d0501c44ae6a93ca00ec068035f8853103e)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !9, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "heat.c", directory: "/afs/ece/project/seth_group/ziqiliu/test/cilk5", checksumkind: CSK_MD5, checksum: "b72599dc1c74f97ddcb465dbfe1586de")
!4 = !{!5, !7, !8}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !{!10, !18, !22, !0, !24, !26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !48, !50}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "specifiers", scope: !2, file: !3, line: 317, type: !12, isLocal: false, isDefinition: true)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 960, elements: !16)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !{!17}
!17 = !DISubrange(count: 15)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "opt_types", scope: !2, file: !3, line: 318, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 480, elements: !16)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "nx", scope: !2, file: !3, line: 67, type: !21, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "nt", scope: !2, file: !3, line: 67, type: !21, isLocal: false, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "xu", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "xo", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "yu", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "yo", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "tu", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "to", scope: !2, file: !3, line: 68, type: !6, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "dx", scope: !2, file: !3, line: 69, type: !6, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "dy", scope: !2, file: !3, line: 69, type: !6, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "dt", scope: !2, file: !3, line: 69, type: !6, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "dtdxsq", scope: !2, file: !3, line: 71, type: !6, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "dtdysq", scope: !2, file: !3, line: 71, type: !6, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "t", scope: !2, file: !3, line: 72, type: !6, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "leafmaxcol", scope: !2, file: !3, line: 74, type: !21, isLocal: false, isDefinition: true)
!52 = !{i32 7, !"Dwarf Version", i32 5}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{i32 7, !"uwtable", i32 1}
!56 = !{!"clang version 14.0.6 (/afs/ece/project/seth_group/ziqiliu/uli-opencilk-project/clang f7f98d0501c44ae6a93ca00ec068035f8853103e)"}
!57 = distinct !DISubprogram(name: "todval", scope: !3, file: !3, line: 45, type: !58, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !71)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61}
!60 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !63, line: 30, size: 128, elements: !64)
!63 = !DIFile(filename: "/usr/include/bits/time.h", directory: "", checksumkind: CSK_MD5, checksum: "7275d681a2390320bc78ae3cf595b8d2")
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !62, file: !63, line: 32, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !67, line: 148, baseType: !68)
!67 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "77efac6352c67c8f56830ba4c854379f")
!68 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !62, file: !63, line: 33, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !67, line: 150, baseType: !68)
!71 = !{!72}
!72 = !DILocalVariable(name: "tp", arg: 1, scope: !57, file: !3, line: 45, type: !61)
!73 = !DILocation(line: 0, scope: !57)
!74 = !DILocation(line: 46, column: 16, scope: !57)
!75 = !{!76, !77, i64 0}
!76 = !{!"timeval", !77, i64 0, !77, i64 8}
!77 = !{!"long", !78, i64 0}
!78 = !{!"omnipotent char", !79, i64 0}
!79 = !{!"Simple C/C++ TBAA"}
!80 = !DILocation(line: 46, column: 30, scope: !57)
!81 = !DILocation(line: 46, column: 43, scope: !57)
!82 = !{!76, !77, i64 8}
!83 = !DILocation(line: 46, column: 37, scope: !57)
!84 = !DILocation(line: 46, column: 5, scope: !57)
!85 = distinct !DISubprogram(name: "startup_cilk", scope: !3, file: !3, line: 50, type: !86, scopeLine: 50, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{null}
!88 = !{!89, !90, !92, !93, !94, !95}
!89 = !DILocalVariable(name: "g", scope: !85, file: !3, line: 51, type: !6)
!90 = !DILocalVariable(name: "__init", scope: !91, type: !21, flags: DIFlagArtificial)
!91 = distinct !DILexicalBlock(scope: !85, file: !3, line: 52, column: 3)
!92 = !DILocalVariable(name: "__limit", scope: !91, type: !21, flags: DIFlagArtificial)
!93 = !DILocalVariable(name: "__begin", scope: !91, type: !21, flags: DIFlagArtificial)
!94 = !DILocalVariable(name: "__end", scope: !91, type: !21, flags: DIFlagArtificial)
!95 = !DILocalVariable(name: "i", scope: !96, file: !3, line: 52, type: !21)
!96 = distinct !DILexicalBlock(scope: !91, file: !3, line: 52, column: 3)
!97 = !DILocation(line: 0, scope: !85)
!98 = !DILocation(line: 51, column: 3, scope: !85)
!99 = !DILocation(line: 51, column: 10, scope: !85)
!100 = !{!101, !101, i64 0}
!101 = !{!"double", !78, i64 0}
!102 = !DILocation(line: 0, scope: !91)
!103 = !DILocation(line: 52, column: 24, scope: !91)
!104 = !DILocation(line: 52, column: 3, scope: !91)
!105 = !DILocation(line: 0, scope: !96)
!106 = !DILocation(line: 53, column: 14, scope: !107)
!107 = distinct !DILexicalBlock(scope: !96, file: !3, line: 52, column: 36)
!108 = !DILocation(line: 53, column: 10, scope: !107)
!109 = !DILocation(line: 53, column: 7, scope: !107)
!110 = !DILocation(line: 54, column: 3, scope: !107)
!111 = !DILocation(line: 52, column: 32, scope: !96)
!112 = !DILocation(line: 52, column: 24, scope: !96)
!113 = !DILocation(line: 52, column: 3, scope: !96)
!114 = distinct !{!114, !104, !115, !116}
!115 = !DILocation(line: 54, column: 3, scope: !91)
!116 = !{!"tapir.loop.spawn.strategy", i32 1}
!117 = !DILocation(line: 55, column: 1, scope: !85)
!118 = distinct !DISubprogram(name: "allcgrid", scope: !3, file: !3, line: 79, type: !119, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !7, !7, !21, !21}
!121 = !{!122, !123, !124, !125, !126, !127, !128}
!122 = !DILocalVariable(name: "neww", arg: 1, scope: !118, file: !3, line: 79, type: !7)
!123 = !DILocalVariable(name: "old", arg: 2, scope: !118, file: !3, line: 79, type: !7)
!124 = !DILocalVariable(name: "lb", arg: 3, scope: !118, file: !3, line: 79, type: !21)
!125 = !DILocalVariable(name: "ub", arg: 4, scope: !118, file: !3, line: 79, type: !21)
!126 = !DILocalVariable(name: "j", scope: !118, file: !3, line: 81, type: !21)
!127 = !DILocalVariable(name: "rne", scope: !118, file: !3, line: 82, type: !7)
!128 = !DILocalVariable(name: "rol", scope: !118, file: !3, line: 82, type: !7)
!129 = !DILocation(line: 0, scope: !118)
!130 = !DILocation(line: 84, column: 21, scope: !131)
!131 = distinct !DILexicalBlock(scope: !118, file: !3, line: 84, column: 3)
!132 = !DILocation(line: 84, column: 41, scope: !133)
!133 = distinct !DILexicalBlock(scope: !131, file: !3, line: 84, column: 3)
!134 = !DILocation(line: 84, column: 3, scope: !131)
!135 = !DILocation(line: 84, column: 34, scope: !131)
!136 = !{!137, !137, i64 0}
!137 = !{!"int", !78, i64 0}
!138 = !DILocation(line: 85, column: 23, scope: !139)
!139 = distinct !DILexicalBlock(scope: !133, file: !3, line: 84, column: 66)
!140 = !DILocation(line: 85, column: 10, scope: !139)
!141 = !{!142, !142, i64 0}
!142 = !{!"any pointer", !78, i64 0}
!143 = !DILocation(line: 86, column: 23, scope: !139)
!144 = !DILocation(line: 86, column: 10, scope: !139)
!145 = !DILocation(line: 84, column: 48, scope: !133)
!146 = !DILocation(line: 84, column: 55, scope: !133)
!147 = !DILocation(line: 84, column: 62, scope: !133)
!148 = distinct !{!148, !134, !149, !150}
!149 = !DILocation(line: 87, column: 3, scope: !131)
!150 = !{!"llvm.loop.mustprogress"}
!151 = !DILocation(line: 88, column: 1, scope: !118)
!152 = distinct !DISubprogram(name: "initgrid", scope: !3, file: !3, line: 92, type: !153, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !155)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !7, !21, !21}
!155 = !{!156, !157, !158, !159, !160, !161, !162}
!156 = !DILocalVariable(name: "old", arg: 1, scope: !152, file: !3, line: 92, type: !7)
!157 = !DILocalVariable(name: "lb", arg: 2, scope: !152, file: !3, line: 92, type: !21)
!158 = !DILocalVariable(name: "ub", arg: 3, scope: !152, file: !3, line: 92, type: !21)
!159 = !DILocalVariable(name: "a", scope: !152, file: !3, line: 94, type: !21)
!160 = !DILocalVariable(name: "b", scope: !152, file: !3, line: 94, type: !21)
!161 = !DILocalVariable(name: "llb", scope: !152, file: !3, line: 94, type: !21)
!162 = !DILocalVariable(name: "lub", scope: !152, file: !3, line: 94, type: !21)
!163 = !DILocation(line: 0, scope: !152)
!164 = !DILocation(line: 96, column: 13, scope: !152)
!165 = !DILocation(line: 96, column: 9, scope: !152)
!166 = !DILocation(line: 97, column: 16, scope: !152)
!167 = !DILocation(line: 97, column: 13, scope: !152)
!168 = !DILocation(line: 97, column: 9, scope: !152)
!169 = !DILocation(line: 99, column: 22, scope: !170)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 99, column: 3)
!171 = distinct !DILexicalBlock(scope: !152, file: !3, line: 99, column: 3)
!172 = !DILocation(line: 99, column: 3, scope: !171)
!173 = !DILocation(line: 100, column: 5, scope: !170)
!174 = !DILocation(line: 100, column: 15, scope: !170)
!175 = !DILocation(line: 99, column: 30, scope: !170)
!176 = distinct !{!176, !177}
!177 = !{!"llvm.loop.unroll.disable"}
!178 = distinct !{!178, !172, !179, !150}
!179 = !DILocation(line: 100, column: 17, scope: !171)
!180 = !DILocation(line: 102, column: 17, scope: !181)
!181 = distinct !DILexicalBlock(scope: !152, file: !3, line: 102, column: 3)
!182 = !DILocation(line: 102, column: 19, scope: !181)
!183 = !DILocation(line: 102, column: 3, scope: !181)
!184 = !DILocation(line: 103, column: 17, scope: !185)
!185 = distinct !DILexicalBlock(scope: !181, file: !3, line: 102, column: 3)
!186 = !DILocation(line: 103, column: 5, scope: !185)
!187 = !DILocation(line: 103, column: 15, scope: !185)
!188 = !DILocation(line: 102, column: 33, scope: !185)
!189 = !DILocation(line: 102, column: 25, scope: !185)
!190 = distinct !{!190, !183, !191, !150}
!191 = !DILocation(line: 103, column: 17, scope: !181)
!192 = !DILocation(line: 105, column: 7, scope: !152)
!193 = !DILocation(line: 106, column: 22, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !3, line: 106, column: 5)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 106, column: 5)
!196 = distinct !DILexicalBlock(scope: !197, file: !3, line: 105, column: 16)
!197 = distinct !DILexicalBlock(scope: !152, file: !3, line: 105, column: 7)
!198 = !DILocation(line: 106, column: 5, scope: !195)
!199 = !DILocation(line: 107, column: 17, scope: !194)
!200 = !DILocation(line: 109, column: 13, scope: !201)
!201 = distinct !DILexicalBlock(scope: !152, file: !3, line: 109, column: 7)
!202 = !DILocation(line: 109, column: 10, scope: !201)
!203 = !DILocation(line: 109, column: 7, scope: !152)
!204 = !DILocation(line: 110, column: 14, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 110, column: 5)
!206 = distinct !DILexicalBlock(scope: !201, file: !3, line: 109, column: 17)
!207 = !DILocation(line: 110, column: 5, scope: !205)
!208 = !DILocation(line: 111, column: 19, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !3, line: 110, column: 5)
!210 = !DILocation(line: 111, column: 7, scope: !209)
!211 = !DILocation(line: 111, column: 17, scope: !209)
!212 = !DILocation(line: 110, column: 32, scope: !209)
!213 = !DILocation(line: 110, column: 27, scope: !209)
!214 = !DILocation(line: 110, column: 25, scope: !209)
!215 = distinct !{!215, !207, !216, !150}
!216 = !DILocation(line: 111, column: 19, scope: !205)
!217 = !DILocation(line: 113, column: 3, scope: !218)
!218 = distinct !DILexicalBlock(scope: !152, file: !3, line: 113, column: 3)
!219 = !DILocation(line: 113, column: 17, scope: !220)
!220 = distinct !DILexicalBlock(scope: !218, file: !3, line: 113, column: 3)
!221 = !DILocation(line: 114, column: 19, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 114, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 114, column: 5)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 113, column: 29)
!225 = !DILocation(line: 114, column: 17, scope: !222)
!226 = !DILocation(line: 114, column: 5, scope: !223)
!227 = !DILocation(line: 115, column: 19, scope: !228)
!228 = distinct !DILexicalBlock(scope: !222, file: !3, line: 114, column: 30)
!229 = !DILocation(line: 115, column: 7, scope: !228)
!230 = !DILocation(line: 115, column: 17, scope: !228)
!231 = !DILocation(line: 114, column: 26, scope: !222)
!232 = !DILocation(line: 114, column: 21, scope: !222)
!233 = distinct !{!233, !226, !234, !150}
!234 = !DILocation(line: 116, column: 5, scope: !223)
!235 = !DILocation(line: 113, column: 25, scope: !220)
!236 = distinct !{!236, !217, !237, !150}
!237 = !DILocation(line: 117, column: 3, scope: !218)
!238 = !DILocation(line: 118, column: 1, scope: !152)
!239 = distinct !DISubprogram(name: "compstripe", scope: !3, file: !3, line: 123, type: !119, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248}
!241 = !DILocalVariable(name: "neww", arg: 1, scope: !239, file: !3, line: 123, type: !7)
!242 = !DILocalVariable(name: "old", arg: 2, scope: !239, file: !3, line: 123, type: !7)
!243 = !DILocalVariable(name: "lb", arg: 3, scope: !239, file: !3, line: 123, type: !21)
!244 = !DILocalVariable(name: "ub", arg: 4, scope: !239, file: !3, line: 123, type: !21)
!245 = !DILocalVariable(name: "a", scope: !239, file: !3, line: 125, type: !21)
!246 = !DILocalVariable(name: "b", scope: !239, file: !3, line: 125, type: !21)
!247 = !DILocalVariable(name: "llb", scope: !239, file: !3, line: 125, type: !21)
!248 = !DILocalVariable(name: "lub", scope: !239, file: !3, line: 125, type: !21)
!249 = !DILocation(line: 0, scope: !239)
!250 = !DILocation(line: 127, column: 13, scope: !239)
!251 = !DILocation(line: 127, column: 9, scope: !239)
!252 = !DILocation(line: 128, column: 16, scope: !239)
!253 = !DILocation(line: 128, column: 13, scope: !239)
!254 = !DILocation(line: 128, column: 9, scope: !239)
!255 = !DILocation(line: 130, column: 17, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 130, column: 3)
!257 = distinct !DILexicalBlock(scope: !239, file: !3, line: 130, column: 3)
!258 = !DILocation(line: 130, column: 3, scope: !257)
!259 = !DILocation(line: 131, column: 5, scope: !260)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 131, column: 5)
!261 = distinct !DILexicalBlock(scope: !256, file: !3, line: 130, column: 29)
!262 = !DILocation(line: 130, column: 25, scope: !256)
!263 = !{!264}
!264 = distinct !{!264, !265}
!265 = distinct !{!265, !"LVerDomain"}
!266 = !{!267}
!267 = distinct !{!267, !265}
!268 = !DILocation(line: 132, column: 32, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !3, line: 131, column: 30)
!270 = distinct !DILexicalBlock(scope: !260, file: !3, line: 131, column: 5)
!271 = !{!272}
!272 = distinct !{!272, !265}
!273 = !DILocation(line: 132, column: 50, scope: !269)
!274 = !{!275}
!275 = distinct !{!275, !265}
!276 = !DILocation(line: 132, column: 44, scope: !269)
!277 = !DILocation(line: 132, column: 62, scope: !269)
!278 = !{!279}
!279 = distinct !{!279, !265}
!280 = !DILocation(line: 132, column: 60, scope: !269)
!281 = !DILocation(line: 133, column: 29, scope: !269)
!282 = !DILocation(line: 133, column: 21, scope: !269)
!283 = !{!284}
!284 = distinct !{!284, !265}
!285 = !DILocation(line: 133, column: 33, scope: !269)
!286 = !DILocation(line: 133, column: 51, scope: !269)
!287 = !{!288}
!288 = distinct !{!288, !265}
!289 = !DILocation(line: 133, column: 49, scope: !269)
!290 = !DILocation(line: 134, column: 9, scope: !269)
!291 = !DILocation(line: 132, column: 7, scope: !269)
!292 = !DILocation(line: 132, column: 18, scope: !269)
!293 = !{!294}
!294 = distinct !{!294, !265}
!295 = !{!264, !272, !275, !279, !267, !284, !288}
!296 = distinct !{!296, !259, !297, !150, !298}
!297 = !DILocation(line: 135, column: 5, scope: !260)
!298 = !{!"llvm.loop.isvectorized", i32 1}
!299 = !DILocation(line: 132, column: 22, scope: !269)
!300 = !DILocation(line: 133, column: 11, scope: !269)
!301 = !DILocation(line: 133, column: 59, scope: !269)
!302 = !DILocation(line: 133, column: 18, scope: !269)
!303 = !DILocation(line: 133, column: 9, scope: !269)
!304 = !DILocation(line: 131, column: 17, scope: !270)
!305 = distinct !{!305, !259, !297, !150, !298}
!306 = distinct !{!306, !258, !307, !150}
!307 = !DILocation(line: 136, column: 3, scope: !257)
!308 = !DILocation(line: 138, column: 19, scope: !309)
!309 = distinct !DILexicalBlock(scope: !239, file: !3, line: 138, column: 3)
!310 = !DILocation(line: 138, column: 3, scope: !309)
!311 = !DILocation(line: 138, column: 25, scope: !312)
!312 = distinct !DILexicalBlock(scope: !309, file: !3, line: 138, column: 3)
!313 = !DILocation(line: 141, column: 3, scope: !314)
!314 = distinct !DILexicalBlock(scope: !239, file: !3, line: 141, column: 3)
!315 = !DILocation(line: 142, column: 5, scope: !316)
!316 = distinct !DILexicalBlock(scope: !314, file: !3, line: 141, column: 3)
!317 = !DILocation(line: 142, column: 16, scope: !316)
!318 = !DILocation(line: 141, column: 30, scope: !316)
!319 = distinct !{!319, !177}
!320 = !DILocation(line: 139, column: 18, scope: !312)
!321 = !DILocation(line: 139, column: 5, scope: !312)
!322 = !DILocation(line: 139, column: 16, scope: !312)
!323 = !DILocation(line: 138, column: 33, scope: !312)
!324 = distinct !{!324, !310, !325, !150}
!325 = !DILocation(line: 139, column: 18, scope: !309)
!326 = !DILocation(line: 141, column: 22, scope: !316)
!327 = distinct !{!327, !313, !328, !150}
!328 = !DILocation(line: 142, column: 18, scope: !314)
!329 = !DILocation(line: 144, column: 7, scope: !239)
!330 = !DILocation(line: 145, column: 22, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !3, line: 145, column: 5)
!332 = distinct !DILexicalBlock(scope: !333, file: !3, line: 145, column: 5)
!333 = distinct !DILexicalBlock(scope: !334, file: !3, line: 144, column: 16)
!334 = distinct !DILexicalBlock(scope: !239, file: !3, line: 144, column: 7)
!335 = !DILocation(line: 145, column: 5, scope: !332)
!336 = !DILocation(line: 146, column: 18, scope: !331)
!337 = !DILocation(line: 148, column: 13, scope: !338)
!338 = distinct !DILexicalBlock(scope: !239, file: !3, line: 148, column: 7)
!339 = !DILocation(line: 148, column: 10, scope: !338)
!340 = !DILocation(line: 148, column: 7, scope: !239)
!341 = !DILocation(line: 149, column: 14, scope: !342)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 149, column: 5)
!343 = distinct !DILexicalBlock(scope: !338, file: !3, line: 148, column: 17)
!344 = !DILocation(line: 149, column: 5, scope: !342)
!345 = !DILocation(line: 150, column: 20, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !3, line: 149, column: 5)
!347 = !DILocation(line: 150, column: 7, scope: !346)
!348 = !DILocation(line: 150, column: 18, scope: !346)
!349 = !DILocation(line: 149, column: 32, scope: !346)
!350 = !DILocation(line: 149, column: 27, scope: !346)
!351 = !DILocation(line: 149, column: 25, scope: !346)
!352 = distinct !{!352, !344, !353, !150}
!353 = !DILocation(line: 150, column: 20, scope: !342)
!354 = !DILocation(line: 152, column: 1, scope: !239)
!355 = distinct !DISubprogram(name: "divide", scope: !3, file: !3, line: 161, type: !356, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !358)
!356 = !DISubroutineType(types: !357)
!357 = !{!21, !21, !21, !7, !7, !21, !21}
!358 = !{!359, !360, !361, !362, !363, !364, !365, !368, !369}
!359 = !DILocalVariable(name: "lb", arg: 1, scope: !355, file: !3, line: 161, type: !21)
!360 = !DILocalVariable(name: "ub", arg: 2, scope: !355, file: !3, line: 161, type: !21)
!361 = !DILocalVariable(name: "neww", arg: 3, scope: !355, file: !3, line: 161, type: !7)
!362 = !DILocalVariable(name: "old", arg: 4, scope: !355, file: !3, line: 162, type: !7)
!363 = !DILocalVariable(name: "mode", arg: 5, scope: !355, file: !3, line: 162, type: !21)
!364 = !DILocalVariable(name: "timestep", arg: 6, scope: !355, file: !3, line: 162, type: !21)
!365 = !DILocalVariable(name: "_tmp", scope: !366, file: !3, line: 165, type: !21)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 164, column: 29)
!367 = distinct !DILexicalBlock(scope: !355, file: !3, line: 164, column: 7)
!368 = !DILocalVariable(name: "l", scope: !366, file: !3, line: 166, type: !21)
!369 = !DILocalVariable(name: "r", scope: !366, file: !3, line: 166, type: !21)
!370 = !DILocation(line: 0, scope: !366)
!371 = !DILocation(line: 0, scope: !355)
!372 = !DILocation(line: 164, column: 10, scope: !367)
!373 = !DILocation(line: 164, column: 17, scope: !367)
!374 = !DILocation(line: 164, column: 15, scope: !367)
!375 = !DILocation(line: 164, column: 7, scope: !355)
!376 = !DILocation(line: 166, column: 5, scope: !366)
!377 = !DILocation(line: 166, column: 9, scope: !366)
!378 = !DILocation(line: 167, column: 35, scope: !366)
!379 = !DILocation(line: 167, column: 41, scope: !366)
!380 = !DILocation(line: 167, column: 20, scope: !366)
!381 = !DILocation(line: 167, column: 7, scope: !366)
!382 = !DILocation(line: 168, column: 9, scope: !366)
!383 = !DILocation(line: 169, column: 5, scope: !366)
!384 = !DILocation(line: 171, column: 12, scope: !366)
!385 = !DILocation(line: 171, column: 14, scope: !366)
!386 = !DILocation(line: 174, column: 3, scope: !367)
!387 = !DILocation(line: 175, column: 5, scope: !388)
!388 = distinct !DILexicalBlock(scope: !367, file: !3, line: 174, column: 10)
!389 = !DILocation(line: 177, column: 22, scope: !390)
!390 = distinct !DILexicalBlock(scope: !391, file: !3, line: 177, column: 13)
!391 = distinct !DILexicalBlock(scope: !388, file: !3, line: 175, column: 19)
!392 = !DILocation(line: 177, column: 13, scope: !391)
!393 = !DILocation(line: 178, column: 11, scope: !390)
!394 = !DILocation(line: 180, column: 11, scope: !390)
!395 = !DILocation(line: 0, scope: !118, inlinedAt: !396)
!396 = distinct !DILocation(line: 184, column: 9, scope: !391)
!397 = !DILocation(line: 84, column: 21, scope: !131, inlinedAt: !396)
!398 = !DILocation(line: 84, column: 41, scope: !133, inlinedAt: !396)
!399 = !DILocation(line: 84, column: 3, scope: !131, inlinedAt: !396)
!400 = !DILocation(line: 84, column: 34, scope: !131, inlinedAt: !396)
!401 = !DILocation(line: 85, column: 23, scope: !139, inlinedAt: !396)
!402 = !DILocation(line: 85, column: 10, scope: !139, inlinedAt: !396)
!403 = !DILocation(line: 86, column: 23, scope: !139, inlinedAt: !396)
!404 = !DILocation(line: 86, column: 10, scope: !139, inlinedAt: !396)
!405 = !DILocation(line: 84, column: 48, scope: !133, inlinedAt: !396)
!406 = !DILocation(line: 84, column: 55, scope: !133, inlinedAt: !396)
!407 = !DILocation(line: 84, column: 62, scope: !133, inlinedAt: !396)
!408 = distinct !{!408, !399, !409, !150}
!409 = !DILocation(line: 87, column: 3, scope: !131, inlinedAt: !396)
!410 = !DILocation(line: 188, column: 9, scope: !391)
!411 = !DILocation(line: 189, column: 9, scope: !391)
!412 = !DILocation(line: 0, scope: !367)
!413 = !DILocation(line: 194, column: 1, scope: !355)
!414 = distinct !DISubprogram(name: "heat", scope: !3, file: !3, line: 196, type: !415, scopeLine: 196, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!21}
!417 = !{!418, !419, !420, !421}
!418 = !DILocalVariable(name: "old", scope: !414, file: !3, line: 198, type: !7)
!419 = !DILocalVariable(name: "neww", scope: !414, file: !3, line: 198, type: !7)
!420 = !DILocalVariable(name: "c", scope: !414, file: !3, line: 199, type: !21)
!421 = !DILocalVariable(name: "l", scope: !414, file: !3, line: 199, type: !21)
!422 = !DILocation(line: 210, column: 28, scope: !414)
!423 = !DILocation(line: 210, column: 31, scope: !414)
!424 = !DILocation(line: 210, column: 21, scope: !414)
!425 = !DILocation(line: 210, column: 9, scope: !414)
!426 = !DILocation(line: 0, scope: !414)
!427 = !DILocation(line: 211, column: 22, scope: !414)
!428 = !DILocation(line: 211, column: 10, scope: !414)
!429 = !DILocation(line: 213, column: 7, scope: !414)
!430 = !DILocation(line: 226, column: 17, scope: !414)
!431 = !DILocation(line: 226, column: 7, scope: !414)
!432 = !DILocation(line: 228, column: 20, scope: !433)
!433 = distinct !DILexicalBlock(scope: !434, file: !3, line: 228, column: 3)
!434 = distinct !DILexicalBlock(scope: !414, file: !3, line: 228, column: 3)
!435 = !DILocation(line: 228, column: 17, scope: !433)
!436 = !DILocation(line: 228, column: 3, scope: !434)
!437 = !DILocation(line: 229, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !433, file: !3, line: 228, column: 29)
!439 = !DILocation(line: 229, column: 14, scope: !438)
!440 = !DILocation(line: 229, column: 18, scope: !438)
!441 = !DILocation(line: 229, column: 12, scope: !438)
!442 = !DILocation(line: 229, column: 7, scope: !438)
!443 = !DILocation(line: 230, column: 19, scope: !438)
!444 = !DILocation(line: 230, column: 9, scope: !438)
!445 = !DILocation(line: 228, column: 25, scope: !433)
!446 = distinct !{!446, !436, !447, !150}
!447 = !DILocation(line: 231, column: 3, scope: !434)
!448 = !DILocation(line: 267, column: 3, scope: !414)
!449 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 270, type: !415, scopeLine: 270, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !450)
!450 = !{}
!451 = !DILocation(line: 272, column: 11, scope: !449)
!452 = !DILocation(line: 272, column: 3, scope: !449)
!453 = !DILocation(line: 273, column: 11, scope: !449)
!454 = !DILocation(line: 273, column: 3, scope: !449)
!455 = !DILocation(line: 275, column: 11, scope: !449)
!456 = !DILocation(line: 275, column: 3, scope: !449)
!457 = !DILocation(line: 277, column: 11, scope: !449)
!458 = !DILocation(line: 277, column: 3, scope: !449)
!459 = !DILocation(line: 278, column: 11, scope: !449)
!460 = !DILocation(line: 278, column: 3, scope: !449)
!461 = !DILocation(line: 279, column: 11, scope: !449)
!462 = !DILocation(line: 279, column: 3, scope: !449)
!463 = !DILocation(line: 281, column: 11, scope: !449)
!464 = !DILocation(line: 281, column: 3, scope: !449)
!465 = !DILocation(line: 283, column: 11, scope: !449)
!466 = !DILocation(line: 283, column: 3, scope: !449)
!467 = !DILocation(line: 285, column: 11, scope: !449)
!468 = !DILocation(line: 285, column: 3, scope: !449)
!469 = !DILocation(line: 287, column: 11, scope: !449)
!470 = !DILocation(line: 287, column: 3, scope: !449)
!471 = !DILocation(line: 288, column: 11, scope: !449)
!472 = !DILocation(line: 288, column: 3, scope: !449)
!473 = !DILocation(line: 297, column: 3, scope: !449)
!474 = distinct !DISubprogram(name: "read_heatparams", scope: !3, file: !3, line: 300, type: !475, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !478)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!478 = !{!479, !480, !538}
!479 = !DILocalVariable(name: "filefn", arg: 1, scope: !474, file: !3, line: 300, type: !477)
!480 = !DILocalVariable(name: "f", scope: !474, file: !3, line: 302, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !483, line: 48, baseType: !484)
!483 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "ccadb277f847191065ca006254171e90")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !485, line: 246, size: 1728, elements: !486)
!485 = !DIFile(filename: "/usr/include/libio.h", directory: "", checksumkind: CSK_MD5, checksum: "93df651ae2428563d8c372201ea10863")
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !507, !508, !509, !510, !512, !514, !516, !520, !523, !525, !526, !527, !528, !529, !533, !534}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !484, file: !485, line: 247, baseType: !21, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !484, file: !485, line: 252, baseType: !477, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !484, file: !485, line: 253, baseType: !477, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !484, file: !485, line: 254, baseType: !477, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !484, file: !485, line: 255, baseType: !477, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !484, file: !485, line: 256, baseType: !477, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !484, file: !485, line: 257, baseType: !477, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !484, file: !485, line: 258, baseType: !477, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !484, file: !485, line: 259, baseType: !477, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !484, file: !485, line: 261, baseType: !477, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !484, file: !485, line: 262, baseType: !477, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !484, file: !485, line: 263, baseType: !477, size: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !484, file: !485, line: 265, baseType: !500, size: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !485, line: 161, size: 192, elements: !502)
!502 = !{!503, !504, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !501, file: !485, line: 162, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !501, file: !485, line: 163, baseType: !505, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !501, file: !485, line: 167, baseType: !21, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !484, file: !485, line: 267, baseType: !505, size: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !484, file: !485, line: 269, baseType: !21, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !484, file: !485, line: 273, baseType: !21, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !484, file: !485, line: 275, baseType: !511, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 140, baseType: !68)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !484, file: !485, line: 279, baseType: !513, size: 16, offset: 1024)
!513 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !484, file: !485, line: 280, baseType: !515, size: 8, offset: 1040)
!515 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !484, file: !485, line: 281, baseType: !517, size: 8, offset: 1048)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 1)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !484, file: !485, line: 285, baseType: !521, size: 64, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !485, line: 155, baseType: null)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !484, file: !485, line: 294, baseType: !524, size: 64, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !67, line: 141, baseType: !68)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !484, file: !485, line: 303, baseType: !8, size: 64, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !484, file: !485, line: 304, baseType: !8, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !484, file: !485, line: 305, baseType: !8, size: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !484, file: !485, line: 306, baseType: !8, size: 64, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !484, file: !485, line: 307, baseType: !530, size: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 46, baseType: !532)
!531 = !DIFile(filename: "ece.cmu.edu/project/seth_group/ziqiliu/uli-opencilk-project/build/lib/clang/14.0.6/include/stddef.h", directory: "/afs", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!532 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !484, file: !485, line: 309, baseType: !21, size: 32, offset: 1536)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !484, file: !485, line: 311, baseType: !535, size: 160, offset: 1568)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 20)
!538 = !DILocalVariable(name: "l", scope: !474, file: !3, line: 303, type: !21)
!539 = !DILocation(line: 0, scope: !474)
!540 = !DILocation(line: 305, column: 12, scope: !541)
!541 = distinct !DILexicalBlock(scope: !474, file: !3, line: 305, column: 7)
!542 = !DILocation(line: 305, column: 32, scope: !541)
!543 = !DILocation(line: 305, column: 7, scope: !474)
!544 = !DILocation(line: 306, column: 5, scope: !545)
!545 = distinct !DILexicalBlock(scope: !541, file: !3, line: 305, column: 41)
!546 = !DILocation(line: 307, column: 5, scope: !545)
!547 = !DILocation(line: 309, column: 7, scope: !474)
!548 = !DILocation(line: 311, column: 9, scope: !549)
!549 = distinct !DILexicalBlock(scope: !474, file: !3, line: 311, column: 7)
!550 = !DILocation(line: 311, column: 7, scope: !474)
!551 = !DILocation(line: 312, column: 43, scope: !549)
!552 = !DILocation(line: 312, column: 5, scope: !549)
!553 = !DILocation(line: 313, column: 3, scope: !474)
!554 = !DILocation(line: 315, column: 1, scope: !474)
!555 = !DISubprogram(name: "fclose", scope: !483, file: !483, line: 237, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !450)
!556 = !DISubroutineType(types: !557)
!557 = !{!21, !481}
!558 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 320, type: !559, scopeLine: 320, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !562)
!559 = !DISubroutineType(types: !560)
!560 = !{!21, !21, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !573, !575, !578, !579}
!563 = !DILocalVariable(name: "argc", arg: 1, scope: !558, file: !3, line: 320, type: !21)
!564 = !DILocalVariable(name: "argv", arg: 2, scope: !558, file: !3, line: 320, type: !561)
!565 = !DILocalVariable(name: "ret", scope: !558, file: !3, line: 322, type: !21)
!566 = !DILocalVariable(name: "benchmark", scope: !558, file: !3, line: 322, type: !21)
!567 = !DILocalVariable(name: "help", scope: !558, file: !3, line: 322, type: !21)
!568 = !DILocalVariable(name: "round", scope: !558, file: !3, line: 322, type: !21)
!569 = !DILocalVariable(name: "filename", scope: !558, file: !3, line: 323, type: !570)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 100)
!573 = !DILocalVariable(name: "r", scope: !574, file: !3, line: 394, type: !21)
!574 = distinct !DILexicalBlock(scope: !558, file: !3, line: 394, column: 3)
!575 = !DILocalVariable(name: "t1", scope: !576, file: !3, line: 405, type: !62)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 394, column: 30)
!577 = distinct !DILexicalBlock(scope: !574, file: !3, line: 394, column: 3)
!578 = !DILocalVariable(name: "t2", scope: !576, file: !3, line: 405, type: !62)
!579 = !DILocalVariable(name: "runtime_ms", scope: !576, file: !3, line: 411, type: !60)
!580 = !DILocation(line: 0, scope: !558)
!581 = !DILocation(line: 322, column: 3, scope: !558)
!582 = !DILocation(line: 323, column: 3, scope: !558)
!583 = !DILocation(line: 323, column: 8, scope: !558)
!584 = !DILocation(line: 325, column: 6, scope: !558)
!585 = !DILocation(line: 326, column: 6, scope: !558)
!586 = !DILocation(line: 327, column: 6, scope: !558)
!587 = !DILocation(line: 328, column: 6, scope: !558)
!588 = !DILocation(line: 329, column: 6, scope: !558)
!589 = !DILocation(line: 330, column: 6, scope: !558)
!590 = !DILocation(line: 331, column: 6, scope: !558)
!591 = !DILocation(line: 332, column: 6, scope: !558)
!592 = !DILocation(line: 333, column: 6, scope: !558)
!593 = !DILocation(line: 334, column: 14, scope: !558)
!594 = !DILocation(line: 335, column: 14, scope: !558)
!595 = !{!78, !78, i64 0}
!596 = !DILocation(line: 336, column: 9, scope: !558)
!597 = !DILocation(line: 340, column: 11, scope: !558)
!598 = !DILocation(line: 340, column: 3, scope: !558)
!599 = !DILocation(line: 342, column: 3, scope: !558)
!600 = !DILocation(line: 346, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !558, file: !3, line: 346, column: 7)
!602 = !DILocation(line: 346, column: 7, scope: !558)
!603 = !DILocation(line: 346, column: 20, scope: !601)
!604 = !DILocation(line: 346, column: 13, scope: !601)
!605 = !DILocation(line: 348, column: 7, scope: !606)
!606 = distinct !DILexicalBlock(scope: !558, file: !3, line: 348, column: 7)
!607 = !DILocation(line: 348, column: 7, scope: !558)
!608 = !DILocation(line: 351, column: 12, scope: !609)
!609 = distinct !DILexicalBlock(scope: !610, file: !3, line: 349, column: 24)
!610 = distinct !DILexicalBlock(scope: !606, file: !3, line: 348, column: 18)
!611 = !DILocation(line: 352, column: 12, scope: !609)
!612 = !DILocation(line: 353, column: 12, scope: !609)
!613 = !DILocation(line: 354, column: 12, scope: !609)
!614 = !DILocation(line: 355, column: 12, scope: !609)
!615 = !DILocation(line: 356, column: 12, scope: !609)
!616 = !DILocation(line: 357, column: 12, scope: !609)
!617 = !DILocation(line: 358, column: 12, scope: !609)
!618 = !DILocation(line: 359, column: 12, scope: !609)
!619 = !DILocation(line: 360, column: 20, scope: !609)
!620 = !DILocation(line: 361, column: 20, scope: !609)
!621 = !DILocation(line: 362, column: 9, scope: !609)
!622 = !DILocation(line: 364, column: 12, scope: !609)
!623 = !DILocation(line: 365, column: 12, scope: !609)
!624 = !DILocation(line: 366, column: 12, scope: !609)
!625 = !DILocation(line: 367, column: 12, scope: !609)
!626 = !DILocation(line: 368, column: 12, scope: !609)
!627 = !DILocation(line: 369, column: 12, scope: !609)
!628 = !DILocation(line: 370, column: 12, scope: !609)
!629 = !DILocation(line: 371, column: 12, scope: !609)
!630 = !DILocation(line: 372, column: 12, scope: !609)
!631 = !DILocation(line: 373, column: 20, scope: !609)
!632 = !DILocation(line: 374, column: 20, scope: !609)
!633 = !DILocation(line: 375, column: 9, scope: !609)
!634 = !DILocation(line: 377, column: 12, scope: !609)
!635 = !DILocation(line: 378, column: 12, scope: !609)
!636 = !DILocation(line: 379, column: 12, scope: !609)
!637 = !DILocation(line: 380, column: 12, scope: !609)
!638 = !DILocation(line: 381, column: 12, scope: !609)
!639 = !DILocation(line: 382, column: 12, scope: !609)
!640 = !DILocation(line: 383, column: 12, scope: !609)
!641 = !DILocation(line: 384, column: 12, scope: !609)
!642 = !DILocation(line: 385, column: 12, scope: !609)
!643 = !DILocation(line: 386, column: 20, scope: !609)
!644 = !DILocation(line: 387, column: 20, scope: !609)
!645 = !DILocation(line: 388, column: 9, scope: !609)
!646 = !DILocation(line: 393, column: 3, scope: !558)
!647 = !DILocation(line: 0, scope: !574)
!648 = !DILocation(line: 394, column: 18, scope: !577)
!649 = !DILocation(line: 394, column: 17, scope: !577)
!650 = !DILocation(line: 394, column: 3, scope: !574)
!651 = !DILocation(line: 396, column: 9, scope: !652)
!652 = distinct !DILexicalBlock(scope: !576, file: !3, line: 396, column: 9)
!653 = !DILocation(line: 396, column: 9, scope: !576)
!654 = !DILocation(line: 396, column: 22, scope: !652)
!655 = !DILocation(line: 398, column: 11, scope: !576)
!656 = !DILocation(line: 398, column: 16, scope: !576)
!657 = !DILocation(line: 398, column: 14, scope: !576)
!658 = !DILocation(line: 398, column: 23, scope: !576)
!659 = !DILocation(line: 398, column: 26, scope: !576)
!660 = !DILocation(line: 398, column: 22, scope: !576)
!661 = !DILocation(line: 398, column: 20, scope: !576)
!662 = !DILocation(line: 398, column: 8, scope: !576)
!663 = !DILocation(line: 399, column: 11, scope: !576)
!664 = !DILocation(line: 399, column: 16, scope: !576)
!665 = !DILocation(line: 399, column: 14, scope: !576)
!666 = !DILocation(line: 399, column: 23, scope: !576)
!667 = !DILocation(line: 399, column: 26, scope: !576)
!668 = !DILocation(line: 399, column: 22, scope: !576)
!669 = !DILocation(line: 399, column: 20, scope: !576)
!670 = !DILocation(line: 399, column: 8, scope: !576)
!671 = !DILocation(line: 400, column: 11, scope: !576)
!672 = !DILocation(line: 400, column: 16, scope: !576)
!673 = !DILocation(line: 400, column: 14, scope: !576)
!674 = !DILocation(line: 400, column: 22, scope: !576)
!675 = !DILocation(line: 400, column: 20, scope: !576)
!676 = !DILocation(line: 400, column: 8, scope: !576)
!677 = !DILocation(line: 402, column: 23, scope: !576)
!678 = !DILocation(line: 402, column: 17, scope: !576)
!679 = !DILocation(line: 402, column: 12, scope: !576)
!680 = !DILocation(line: 403, column: 23, scope: !576)
!681 = !DILocation(line: 403, column: 17, scope: !576)
!682 = !DILocation(line: 403, column: 12, scope: !576)
!683 = !DILocation(line: 405, column: 5, scope: !576)
!684 = !DILocation(line: 405, column: 20, scope: !576)
!685 = !DILocation(line: 405, column: 24, scope: !576)
!686 = !DILocation(line: 406, column: 5, scope: !576)
!687 = !DILocation(line: 408, column: 11, scope: !576)
!688 = !DILocation(line: 410, column: 5, scope: !576)
!689 = !DILocation(line: 0, scope: !57, inlinedAt: !690)
!690 = distinct !DILocation(line: 411, column: 38, scope: !576)
!691 = !DILocation(line: 46, column: 16, scope: !57, inlinedAt: !690)
!692 = !DILocation(line: 46, column: 43, scope: !57, inlinedAt: !690)
!693 = !DILocation(line: 0, scope: !57, inlinedAt: !694)
!694 = distinct !DILocation(line: 411, column: 50, scope: !576)
!695 = !DILocation(line: 46, column: 16, scope: !57, inlinedAt: !694)
!696 = !DILocation(line: 46, column: 43, scope: !57, inlinedAt: !694)
!697 = !DILocation(line: 46, column: 37, scope: !57, inlinedAt: !690)
!698 = !DILocation(line: 411, column: 49, scope: !576)
!699 = !DILocation(line: 411, column: 62, scope: !576)
!700 = !DILocation(line: 0, scope: !576)
!701 = !DILocation(line: 412, column: 31, scope: !576)
!702 = !DILocation(line: 412, column: 41, scope: !576)
!703 = !DILocation(line: 412, column: 5, scope: !576)
!704 = !DILocation(line: 414, column: 13, scope: !576)
!705 = !DILocation(line: 414, column: 5, scope: !576)
!706 = !DILocation(line: 415, column: 13, scope: !576)
!707 = !DILocation(line: 415, column: 37, scope: !576)
!708 = !DILocation(line: 415, column: 5, scope: !576)
!709 = !DILocation(line: 416, column: 13, scope: !576)
!710 = !DILocation(line: 416, column: 37, scope: !576)
!711 = !DILocation(line: 416, column: 5, scope: !576)
!712 = !DILocation(line: 417, column: 13, scope: !576)
!713 = !DILocation(line: 417, column: 37, scope: !576)
!714 = !DILocation(line: 417, column: 5, scope: !576)
!715 = !DILocation(line: 419, column: 13, scope: !576)
!716 = !DILocation(line: 420, column: 13, scope: !576)
!717 = !DILocation(line: 420, column: 19, scope: !576)
!718 = !DILocation(line: 420, column: 36, scope: !576)
!719 = !DILocation(line: 420, column: 22, scope: !576)
!720 = !DILocation(line: 420, column: 16, scope: !576)
!721 = !DILocation(line: 420, column: 28, scope: !576)
!722 = !DILocation(line: 420, column: 10, scope: !576)
!723 = !DILocation(line: 419, column: 5, scope: !576)
!724 = !DILocation(line: 421, column: 13, scope: !576)
!725 = !DILocation(line: 421, column: 52, scope: !576)
!726 = !DILocation(line: 421, column: 5, scope: !576)
!727 = !DILocation(line: 422, column: 13, scope: !576)
!728 = !DILocation(line: 422, column: 52, scope: !576)
!729 = !DILocation(line: 422, column: 5, scope: !576)
!730 = !DILocation(line: 423, column: 13, scope: !576)
!731 = !DILocation(line: 423, column: 52, scope: !576)
!732 = !DILocation(line: 423, column: 5, scope: !576)
!733 = !DILocation(line: 424, column: 13, scope: !576)
!734 = !DILocation(line: 424, column: 52, scope: !576)
!735 = !DILocation(line: 424, column: 5, scope: !576)
!736 = !DILocation(line: 426, column: 3, scope: !577)
!737 = !DILocation(line: 394, column: 26, scope: !577)
!738 = distinct !{!738, !650, !739, !150}
!739 = !DILocation(line: 426, column: 3, scope: !574)
!740 = !DILocation(line: 428, column: 1, scope: !558)
!741 = !DISubprogram(name: "get_options", scope: !742, file: !742, line: 20, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !450)
!742 = !DIFile(filename: "./getoptions.h", directory: "/afs/ece/project/seth_group/ziqiliu/test/cilk5", checksumkind: CSK_MD5, checksum: "bf060e74fdb298e4a85522e522cd3a24")
!743 = !DISubroutineType(types: !744)
!744 = !{null, !21, !561, !745, !746, null}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!747 = !DISubprogram(name: "gettimeofday", scope: !748, file: !748, line: 72, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !450)
!748 = !DIFile(filename: "/usr/include/sys/time.h", directory: "", checksumkind: CSK_MD5, checksum: "3b3cbcac52b1954fa045aa74bfcd1a38")
!749 = !DISubroutineType(types: !750)
!750 = !{!21, !751, !752}
!751 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__timezone_ptr_t", file: !748, line: 62, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !748, line: 56, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !755, file: !748, line: 58, baseType: !21, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !755, file: !748, line: 59, baseType: !21, size: 32, offset: 32)
